In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Cabin','Embarked','Ticket'], axis =1,inplace = True)

In [4]:
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [5]:
df.describe()

           Pclass         Age        Fare    Survived
count  891.000000  714.000000  891.000000  891.000000
mean     2.308642   29.699118   32.204208    0.383838
std      0.836071   14.526497   49.693429    0.486592
min      1.000000    0.420000    0.000000    0.000000
25%      2.000000   20.125000    7.910400    0.000000
50%      3.000000   28.000000   14.454200    0.000000
75%      3.000000   38.000000   31.000000    1.000000
max      3.000000   80.000000  512.329200    1.000000

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    891 non-null    int64
 1   Sex       891 non-null    object
 2   Age       714 non-null    float64
 3   Fare      891 non-null    float64
 4   Survived  891 non-null    int64
dtypes: float64(2), int64(2), object(1)
memory usage: 34.9+ KB

In [7]:
inputs=df.drop('Survived',axis=1)

In [8]:
inputs.head(2)

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833

In [9]:
target=df['Survived']

In [10]:
inputs.shape

(891, 4)

In [11]:
target.shape

(891,)

In [12]:
dummies=pd.get_dummies(inputs.Sex)

In [13]:
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [14]:
input=pd.concat([inputs,dummies],axis=1)

In [15]:
input.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [16]:
input.drop(['Sex','male'],axis=1,inplace=True)
input.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [17]:
input.columns[input.isna().any()]

Index(['Age'], dtype='object')

In [18]:
input.isna().any()

Pclass    False
Age        True
Fare      False
female    False
dtype: bool

In [19]:
input.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [20]:
input.Age=input.Age.fillna(input.Age.mode()[0])

In [21]:
input[:7]

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0
5       3  24.0   8.4583       0
6       1  54.0  51.8625       0

In [22]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(input,target,test_size=0.2,random_state=25)

In [23]:
X_train.shape

(712, 4)

In [24]:
len(X_train)

712

In [25]:
X_test.shape

(179, 4)

In [26]:
len(X_test)

179

In [27]:
input.shape

(891, 4)

In [28]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [29]:
model.fit(X_train,y_train)

GaussianNB()

In [30]:
model.score(X_test,y_test)

0.7877094972067039

In [31]:
y_test[:10]

760    0
773    0
266    0
507    1
524    0
169    0
189    0
360    0
691    1
335    0
Name: Survived, dtype: int64

In [32]:
model.predict(X_test[:10])

array([0, 0, 0, 0, 0, 0, 0, 0, 1, 0], dtype=int64)

In [33]:
model.predict_proba(X_test[:10])

array([[0.96042367, 0.03957633],
       [0.95962746, 0.04037254],
       [0.94216848, 0.05783152],
       [0.73529685, 0.26470315],
       [0.95962843, 0.04037157],
       [0.9233075 , 0.0766925 ],
       [0.9647124 , 0.0352876 ],
       [0.9636707 , 0.0363293 ],
       [0.32147235, 0.67852765],
       [0.95977374, 0.04022626]])